pascal-4.0/tutorials/surfaceTracking/interTrackFoam/varCapillarity3DoneFluid/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

applicationClass    interTrackFoam;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             5.0;

deltaT              0.001;

adjustTimeStep      yes;

maxCo               2.0;

maxDeltaT           0.01;

writeControl        adjustableRunTime;
// writeControl        timeStep;

writeInterval       0.05;
// writeInterval       1;

cycleWrite          0;

writeFormat         ascii;

writeCompression    compressed;

timeFormat          general;

timePrecision       6;

runTimeModifiable   yes;

//functions
//(
//   history
//   {
//       type sloshingHistory;
//       functionObjectLibs
//       (
//         "libsloshingHistory.so"
//       );
//   }
//);

// ************************************************************************* //

