pascal-4.0/tutorials/surfaceTracking/interTrackFoam/varCapillarity3DoneFluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    bottomWall
    {
        type            wall;
        nFaces          400;
        startFace       22800;
    }
    trackedSurface
    {
        type            patch;
        nFaces          400;
        startFace       23200;
    }
    sideWalls
    {
        type            wall;
        nFaces          1600;
        startFace       23600;
    }
)

// ************************************************************************* //
